# Pandas数据处理
## 1.导入pandas

In [ ]:
#如果你还没有安装pandas那么需要运行下面这行代码
!pip install pandas

In [2]:
import pandas as pd
pd.__version__

'1.1.3'

## 2.pandas对象简介
pandas有3个基本数据结构：Series、DataFrame和Index

### 2.1Pandas的Series对象
Pandas的Series对象是一个带索引数据构成的一维数组。可以用一个数组创建Series对象

In [3]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

Series对象将一组数据和一组索引绑定在一起，我们可以通过values属性和index属性获取数据。values属性返回的结果与NumPy数组类似

In [4]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

index属性返回的结果是一个类型为pd.Index的类数组对象

In [6]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
#可以像Python数组一样使用
data[1]

0.5

In [9]:
data[1:3]

1    0.50
2    0.75
dtype: float64

**1.Series是通用的NumPy数组**  
NumPy数组通过隐式定义的数组索引获取数值，而Pandas Series对象用一种显示定义的索引与数值关联

In [10]:
#显式索引的定义让Series对象拥有了更强的能力。
#例如，索引不再仅仅是数组，还可以是任意想要的类型
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [12]:
#也可以使用不连续或不按顺序的索引
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                index=[2, 5, 3, 7])
data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

**2.Series是特殊的字典**  
Series对象是一种将类型键映射到一组类型值的数据结构。类型至关重要：就像Numpy数组背后特定类型的经过编译的代码使得它在某些操作上比普通的Python列表更加高效一样，Pandas Series的类型信息使得它在某些操作上比Python的字典更高效

In [22]:
population_dict = {'California': 38332521,
                  'Texas': 26448193,
                  'New York': 19651127,
                  'Florida': 19552860,
                  'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

用字典创建Series对象时，其索引默认按照顺序排列

In [23]:
population['California']

38332521

 和字典不同，Series对象还支持切片

In [24]:
population['California': 'Illinois']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

 **3.创建Series对象**  
    
    pd.Series(data, index=index)
    
    其中，index是一个可选参数，data参数支持多种数据类型

In [16]:
#例如，data可以是列表或NumPy数组，这时index默认值为整数序列：
pd.Series([2, 4, 6])

0    2
1    4
2    6
dtype: int64

In [17]:
#data也可以是一个标量，创建Series对象时会重复填充到每个索引上：
pd.Series(5, index=[100, 200, 300])

100    5
200    5
300    5
dtype: int64

In [18]:
#data还可以是一个字典，index默认是排序的字典值
pd.Series({2: 'a', 1:'b', 3:'c'})

2    a
1    b
3    c
dtype: object

In [19]:
#每一种形式都可以是通过显示指定索引筛选需要的结果：
pd.Series({2: 'a', 1:'b', 3:'c'}, index=[3, 2])

3    c
2    a
dtype: object

### 2.2Pandas的DataFrame对象  
Pandas的另一个数据结构是DataFrame，既可以当做通用型NumPy数组，也可以看作特殊的Python字典

**1.DataFrame是通用的NumPy数组**  
如果将Series类比作为带灵活索引的一维数组，那么DataFrame就可以看作是一种既有灵活的行缩影，又有灵活列名的二维数组

In [27]:
#用上一节美国五个州的面积数据创建一个新的Series来进行演示
area_dict = {'California': 423967, 'Texas': 695662, 
             'New York': 141297, 'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [28]:
#再结合之前创建的population的Series对象，用一个字典创建一个包含这些信息的二维对象：
states = pd.DataFrame({'population': population, 'area': area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [29]:
#和Series对象一样，DataFrame也有一个index属性可以获取索引标签：
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [30]:
#DataFrame还有一个columns属性，是存放列标签的Index对象：
states.columns

Index(['population', 'area'], dtype='object')

**2.DataFrame是特殊的字典**
与Series类似，我们也可以把DataFrame看成一种特殊字典。字典是一个键映射一个值，而DataFrame是一列映射一个Series的数据。

In [31]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

**3.创建DataFrame对象**

In [32]:
#（1）通过单个Series对象创建。DataFrame是一组对象的集合，可以用单个Series创建一个单列的DataFrame:
pd.DataFrame(population, columns=['population'])

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [33]:
#（2）通过字典列表创建。任何元素是字典的列表都可以变成DataFrame。用一个简单的列表综合来创建一些数据
data = [{'a': i, 'b': 2*i}
       for i in range(3)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

In [34]:
#即使字典中有些键不存在，Pandas也会用NaN来表示：
pd.DataFrame([{'a': 1, 'b':2}, {'b': 3, 'c':4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [35]:
#通过Series对象字典创建
pd.DataFrame({'population': population, 'area': area})

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [36]:
#（4）通过NumPy二维数组创建。假如有一个二维数组，就可以创建一个可以指定行索引值的DataFrame
pd.DataFrame(np.random.rand(3, 2),
            columns=['foo', 'bar'],
            index=['a', 'b', 'c'])

        foo       bar
a  0.098068  0.287361
b  0.462113  0.051438
c  0.262081  0.888718

In [37]:
#（5）通过NumPy结构化数组创建
A = np.zeros(3, dtype=[('A', 'i8'), ('B', 'f8')])
A

array([(0, 0.), (0, 0.), (0, 0.)], dtype=[('A', '<i8'), ('B', '<f8')])

In [38]:
pd.DataFrame(A)

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

### 2.3Pandas的Index对象
Pandas的Index对象是一个不可变数组或有序集合

In [39]:
ind = pd.Index([2, 3, 5, 7, 11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

**1.将Index看作不可变数组**  
Index对象的许多操作都像数组。可以通过标准Python的取值方法获取数值，也可以通过切片获取数值

In [41]:
ind[1]

3

In [42]:
ind[::2]

Int64Index([2, 5, 11], dtype='int64')

In [43]:
print(ind.size, ind.shape, ind.min, ind.dtype)

5 (5,) <bound method IndexOpsMixin.min of Int64Index([2, 3, 5, 7, 11], dtype='int64')> int64

In [44]:
#Index对象与NumPy数组之间的不同在于，Index对象的索引是不可变的，也就是说不能通过一般的方式进行调整
ind[1] = 0

TypeError: Index does not support mutable operations

**2.将Index看作有序集合**  
Pandas对象被设计用于实现许多操作，如连接（join）数据集，其中会涉及许多集合操作。Index对象遵循Python标准库的集合（set）数据结构的许多习惯用法，包括并集、交集、差集

In [45]:
indA = pd.Index([1, 3, 5, 7, 9])
indB = pd.Index([2, 3, 5, 7, 11])

In [46]:
indA & indB

Int64Index([3, 5, 7], dtype='int64')

In [47]:
indA | indB

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [48]:
indA ^ indB

Int64Index([1, 2, 9, 11], dtype='int64')

## 3.数据取值和选择
### 3.1series数据选择方法  
**1.将Series看作字典**

In [49]:
import pandas as pd
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [50]:
data['b']

0.5

In [51]:
#还可以用Python字典的表达方式和方法来检测键/索引和值：
'a' in data

True

In [52]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [53]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [54]:
#Series对象还可以用字典语法调整数据
data['e'] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

**2.将Series看作一维数组**  
Series不仅有着和字典一样的接口，而且还具备和NumPy数组一样的数组选择功能，包括索引、掩码、花哨的索引等操作

In [55]:
data['a': 'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [56]:
#将隐式整数作为切片
data[0:2]

a    0.25
b    0.50
dtype: float64

In [57]:
#掩码
data[(data > 0.3) & (data < 0.8)]

b    0.50
c    0.75
dtype: float64

In [58]:
#花哨的索引
data[['a', 'e']]

a    0.25
e    1.25
dtype: float64

**3.索引器：loc、iloc和ix**

In [60]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [61]:
#取值操作是显式索引
data[1]

'a'

In [62]:
#切片操作是隐式索引
data[1:3]

3    b
5    c
dtype: object

由于整数索引很容易造成混淆，所以Pandas提供了一些索引器（indexer）属性来作为取值的方法。它们不是Series对象的函数方法，而是暴露切片接口的属性。

In [63]:
#第一种索引器是loc属性，表示取值和切片都是显式的
data.loc[1]

'a'

In [64]:
data.loc[1:3]

1    a
3    b
dtype: object

In [65]:
#第二种是iloc属性，表示取值和切片都是Python形式的隐式索引：
data.iloc[1]

'b'

In [66]:
data.iloc[1:3]

3    b
5    c
dtype: object

第三种取值属性是ix，它是前两种索引器的混合形式，在Series对象中ix等价于标准的[]取值方式。ix索引器主要用于DataFrame对象，后面将会介绍  
Python代码的设计原则之一是“显式优于隐式”。使用loc和iloc可以让代码更容易维护，可读性更高。
  


### 3.2DataFrame数据选择方法  
**1.将DataFrmae看作字典**

In [80]:
area = pd.Series({'California': 423967, 'Texas': 695662, 'New York': 141297,
                 'Florida': 170312, 'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193, 'New York': 19651127,
                 'Florida': 19552860, 'Illinois': 12882135})
data = pd.DataFrame({'area': area, 'pop': pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [68]:
#两个Series分别构成DataFrame的一列，可以通过对列名进行字典形式（dictionary-style）的取值获取数据
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illionis      149995
Name: area, dtype: int64

In [81]:
#也可以用属性形式（attribute-style）选择纯字符串列名的数据：
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [82]:
#对同一个对象进行属性形式与字典形式的列数据
data.area is data['area']

True

In [83]:
#如果列名不是纯字符串，或者列名与DataFrame的方法同名，那么就不能用属性索引
data.pop is data['pop']

False

In [84]:
#如果要增加一列
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

**2.将DataFrame看作二维数组**

In [74]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [85]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [76]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [86]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [87]:
#通过iloc索引器，我们就可以像对待NumPy数组一样索引Pandas的底层数组，DataFrame的行列标签会自动保留在结果中
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [88]:
data.loc[:'Illinois', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [91]:
data.loc[data.density > 100, ['pop', 'density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [92]:
data.iloc[0, 2] = 90
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

**3.其他取值方法**  
首先，如果对单个标签取值就选择列，而对多个标签用切片就选择行

In [93]:
data['Florida':'Illinois']

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [94]:
#切片也可以不用索引值，而直接用行数来实现
data[1:3]

            area       pop     density
Texas     695662  26448193   38.018740
New York  141297  19651127  139.076746

In [95]:
data[data.density > 100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121

## 4.Pandas数值运算的方法  
NumPy的基本能力之一是快速对每个元素进行运算，即包括算术运算，也包括更复杂的运算。  
但是pandas也实现了一些高效的技巧：对于一元运算，这些通用函数将输出结果中保留索引列和列标签；而对于二元运算，pandas在传递通用函数时会自动对齐索引进行计算  
### 4.1通用函数：保留索引

In [96]:
import pandas as pd
import numpy as np

In [97]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [98]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
                columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [99]:
#如果对这两个对象的其中一个使用NumPy通用函数，生成的结果是另一个保留索引的Pandas对象
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [100]:
#或者，再做一个比较复杂的运算：
np.sin(df * np.pi / 4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

### 4.2通用函数：索引对齐  
当在两个Series或DataFrame对象上进行二元计算时，Pandas会在计算过程中对齐两个对象的索引  
**1.Series索引对齐**

In [101]:
#假如你要整合两个数据源的数据，其中一个是美国面积最大的三个州的面积数据，另一个是美国人口最多的三个州的人口数据：
area = pd.Series({'Alaska': 172337, 'Texas': 695662, 'California': 423967},
                name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                       'New York': 19651127}, name='population')

In [102]:
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [103]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [104]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [105]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

**2.DataFrame索引对齐**

In [106]:
#在计算两个DataFrame时，类似的索引对齐规则也同样会出现在共同列中：
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                columns=list('AB'))
A

   A   B
0  1  11
1  5   1

In [108]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
                columns=list('BAC'))
B

   B  A  C
0  3  8  2
1  4  2  6
2  4  8  6

In [109]:
A + B

     A     B   C
0  9.0  14.0 NaN
1  7.0   5.0 NaN
2  NaN   NaN NaN

In [110]:
#在Series中，我们可以通过运算符方法的fill_value参数自定义缺失值。
fill = A.stack().mean()
A.add(B, fill_value=fill)

      A     B     C
0   9.0  14.0   6.5
1   7.0   5.0  10.5
2  12.5   8.5  10.5


    |Python预算符与Pandas方法的映射关系|
|Python运算符|Pandas方法|
|--|--|
|+|add()|
|-|sub()、subtract()|
|* |mul()、multiply()|
|/|truediv()、div()、divide()|
|//|floordiv()|
|%|mod()|
|** |pow()|

### 4.3通用函数：DataFrame与Series的运算

In [111]:
A = rng.randint(10, size=(3, 4))
A

array([[1, 3, 8, 1],
       [9, 8, 9, 4],
       [1, 3, 6, 7]])

In [112]:
A - A[0]

array([[ 0,  0,  0,  0],
       [ 8,  5,  1,  3],
       [ 0,  0, -2,  6]])

In [113]:
df = pd.DataFrame(A, columns=list('QRST'))
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1  8  5  1  3
2  0  0 -2  6

In [114]:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0 -2  0  5 -2
1  1  0  1 -4
2 -2  0  3  4

In [116]:
halfrow = df.iloc[0, ::2]
halfrow

Q    1
S    8
Name: 0, dtype: int64

In [117]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1  8.0 NaN  1.0 NaN
2  0.0 NaN -2.0 NaN

## 5.处理缺失值  
### 5.1选择处理缺失值的方法  
在数据表或DataFrame中有很多识别缺失值的方法。一般情况下可以分为两种：一种方法是通过一个覆盖全局的掩码表示缺失值，另一个方法是用一个标签值（sentinel value）表示缺失值。
在掩码方法中，掩码可能是一个与原数组维度相同的完整布尔类型数组，也可能是用一个比特（0 or 1）表示有缺失值的局部状态  
在标签方法中，标签值可能是具体的数据，也可能是些极少出现的形式。另外，标签值还可能是更全局的值，比如用NaN（不是一个数）表示缺失的浮点数，他是IEEE浮点数规范中指定的特殊字符  
使用这两种方法之前都需要先综合考量：使用单独的掩码数组会额外出现一个布尔类型数组，从而增加存储与计算的负担；而标签值方法缩小了可以被表示为有效值的范围，可能是需要在CPU或GPU算术逻辑单元中增加额外的计算逻辑。通常使用的NaN也不能表示所有数据类型。


### 5.2Pandas的缺失值  
**1.None：Python对象类型的缺失值**  
Pandas可以使用的第一种缺失值标签是None，它是一个Python单体对象，经常在代码中表示缺失值。由于None是一个Python对象，所以不能作为任何NumPy/Pandas数组类型的缺失值，只能用于'object'数组类型

In [118]:
import numpy as np
import pandas as pd

In [119]:
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [120]:
'''这里dtype=object表示NumPy认为由于这个数组是Python对象构成的，因此将其类型判断为object。
    虽然这种类型在某些情景中非常有用，对数据的任何操作最终回在Python层面完成，但是在进行常见的快速操作时，
    这种类型比其他原生类型数组要消耗更多的资源'''
for dtype in ['object', 'int']:
    print("dtype=", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype= object
62.7 ms ± 1.02 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype= int
2.22 ms ± 77 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

**2.NaN:数值类型的缺失值**

In [123]:
#另一种缺失值的标签是NaN（全称Not a Number,鄙不是一个数字）
#是一种按照IEEE浮点数标准设计、在任何系统中都兼容的特殊浮点数
vals2 = np.array([1, np.nan, 3, 4])
vals2.dtype

dtype('float64')

In [124]:
1 + np.nan

nan

In [125]:
0 * np.nan

nan

In [126]:
vals2.sum(), vals2.min(), vals.max()

(nan, nan, nan)

In [127]:
#NumPy提供了一些特殊的累积函数，可以忽略缺失值的影响
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

**3.Pandas中NaN与None的差异**

In [128]:
#在Pandas把它们可以看成是可以等价交换，在适当的时候会将两者进行替换交换
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [129]:
#Pandas会将没有标签值的数据类型自动转换为NA。
#例如，当我们将整型数组中的一个值设置为np.nan时，这个值就会强制转换成浮点数缺失值NA
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int64

In [131]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

表3-2:Pandas对不同类型缺失值的转换规则
    
    
|类型|缺失值转换规则|NA标签值|
|--|--|--|
|floating浮点型|无变化|np.nan|
|object对象类型|无变化|None或np.nan|
|integer整数类型|强制转换为float64|np.nan|
|boolean布尔类型|强制转换为object|None或np.nan|

### 5.3处理缺失值  
Pandas基本上把None和NaN看成是可以等价交换的缺失值形式。Pandas提供了一些方法来发现、剔除、替换数据结构中的缺失值  

isnull()  
    创建一个布尔类型的掩码标签缺失值
notnull()
    与isnull()操作相反  
dropna()
    返回一个剔除缺失值的数据  
fillna()  
    返回一个填充了缺失值的数据副本  


**1.发现缺失值**

In [132]:
#Pandas数据结构有两种有效的方法可以发现缺失值：isnull()和notnull()。
#每种方法都返回布尔类型的掩码数据
data = pd.Series([1, np.nan, 'hello', None])

In [133]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [134]:
#布尔类型掩码数组可以直接作为Series或DataFrame的索引使用:
data[data.notnull()]

0        1
2    hello
dtype: object

**2.剔除缺失值**  
除了前面介绍的掩码方法，还有两种很好用的缺失值处理方法，分别是dropna()（剔除缺失值）和fillna()（填充缺失值）

In [135]:
data.dropna()

0        1
2    hello
dtype: object

In [137]:
df = pd.DataFrame([[1, np.nan, 2],
                  [2, 3, 5],
                  [np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [138]:
#默认情况下，dropname()会剔除任何包含缺失值的整行数据
df.dropna()

     0    1  2
1  2.0  3.0  5

In [140]:
#可以设置按不同的坐标剔除缺失值，比如axis=1（或axis='colums'）会剔除任何包含缺失值的整行数据：
df.dropna(axis='columns')

   2
0  2
1  5
2  6

这么做也会把非缺失值一并剔除，因为可能有时候只需要剔除全部是缺失值的行或列，或者绝大多数是缺失值的行或列。这些需求可以通过设置how或thresh参数来满足，它们可以设置剔除行或列缺失值的数据阈值

In [141]:
#默认设置是how='any'，也就是说只要有缺失值就剔除整行或整列（通过axis设置坐标轴）
#你还可以设置how='all'，这样就只会剔除全部是缺失值的行和列
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [142]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [143]:
#通过thresh参数设置列或行中非缺失值的最小数量
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

**3.填充缺失值**  
有时候你可能并不想移除缺失值，而是想把它们替换成有效的数值。有效的值可能是像0、1、2那样单独的值，也可能是经过填充(inputation)或转换(interpolation)得到的。虽然你可以通过isnull()方法建立掩码来填充缺失值，但是Pandas为此专门提供了一个fillna（）方法，它将返回了缺失值后的数组的副本

In [144]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [145]:
#我们将用一个单独的值来填充缺失值，例如用0:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [146]:
#可以用缺失值前面的有效值来从前往后填充（forward-fill）
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [147]:
#可以用缺失值前面的有效值来从前往后填充(forward-fill)
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [148]:
#也可以用缺失值后面的有效值来从后往前填充(back-fill)
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [149]:
#DataFrame的操作方法与Series类似，只是在填充时需要坐标轴参数axis：
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [150]:
df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

## 6.层级索引  
当数据索引超过一两个键，Pandas提供了Panel和Panel4D对象解决三维数据与思维数据，而在实践中，更直观的形式是通过层级索引(hierachical indexing，也被称为多级索引，multi-indexing)配合多个有不同等级的一级索引一起使用，这也就可以将高维数组转换类似一维Series和二维DataFrame对象的形式
### 6.1多级索引Series
**1.笨方法**

In [163]:
#用元组来表示
index = [('California', 2000), ('California', 2010), 
         ('New York', 2000), ('New York', 2010), 
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
              18976457, 19378102,
              20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [164]:
#假设你想要选择所有2000年的数据，那么就得用一些比较复杂的清理方法：
pop[[i for i in pop.index if i[1] == 2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

**2.好办法：Pandas多级索引**  
用元组表示索引其实是多级索引的基础，Pandas的MultiIndex类型提供了更丰富的操作方法

In [165]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [166]:
#如果将前面创建的pop的索引重置（reindex）为MultiIndex，就会看到层级索引
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [167]:
#可以直接用第二个索引获取2010年的全部数据，与Pandas的切片查询一致
pop[:,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

**3.高维数据的多级索引**

In [168]:
#unstack()方法可以快速将一个多级索引的Series转化为普通索引的DataFrame
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [169]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [170]:
pop_df = pd.DataFrame({'total': pop,
                      'under18': [9267089, 9284094,
                                 4687374, 4318033,
                                 5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

### 6.2多级索引的创建方法

In [171]:
#为Series或DataFrame创建多级索引最直接的方法就是将index参数设置为至少二维的索引数组
df = pd.DataFrame(np.random.rand(4, 2),
                 index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                 columns=['data1', 'data2'])
df

        data1     data2
a 1  0.389538  0.810479
  2  0.452184  0.506920
b 1  0.025454  0.516185
  2  0.804636  0.545459

In [172]:
#如果把元组作为键的字典传递给Pandas，Pandas也会默认转换为MultiIndex
data = {('California', 2000): 33871648,
       ('California', 2010): 37253956,
       ('Texas', 2000): 20851820,
       ('Texas', 2010): 25145561,
       ('New York', 2000): 18976457,
       ('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

**1.显式地创建多级索引**

In [173]:
#可以用pd.MultiIndex中的类方法更加灵活地构建多级索引
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [174]:
#通过包含多级索引值的元组构成的列表MultiIndex
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [175]:
#还可以用两个索引的笛卡尔积(Cartesian product)创建MultiIndex
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

**2.多级索引的等级名称**

In [178]:
#可以在前面任何一个MultiIndex构造器中通过names参数设置等级名称，也可以在创建之后通过索引的names属性来修改名称
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

**3.多级列索引**

In [179]:
#每个DataFrame的行与列都是对称的

#多级行列索引
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                  names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                    names=['subject', 'type'])

#模拟数据
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

#创建DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      29.0  36.5  38.0  36.3  46.0  39.0
     2      69.0  36.4  49.0  37.0  51.0  37.4
2014 1      27.0  36.5  32.0  36.3  33.0  37.0
     2      14.0  37.1  40.0  35.9  50.0  38.6

In [180]:
#可以在列索引的第一级查询姓名，从而获取包含一个人全部检查信息的DataFrame
health_data['Guido']

type          HR  Temp
year visit
2013 1      38.0  36.3
     2      49.0  37.0
2014 1      32.0  36.3
     2      40.0  35.9

### 6.3多级索引的取值与切片
**1.Series多级索引**

In [181]:
#看看下面由各州历年人口数量创建的多级索引Series
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [182]:
#可以通过多个级别索引值获取单个元素
pop['California', 2000]

33871648

In [183]:
#MultiIndex也支持局部取值（partial indexing），即只取索引的某一个层级
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [184]:
pop.loc['California': 'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [185]:
pop[:, 2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [187]:
#其他取值方法
pop[pop > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [189]:
pop[['California', 'Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

**2.DataFrame多级索引**

In [190]:
#DataFrame多级索引的用法与Series类似
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      29.0  36.5  38.0  36.3  46.0  39.0
     2      69.0  36.4  49.0  37.0  51.0  37.4
2014 1      27.0  36.5  32.0  36.3  33.0  37.0
     2      14.0  37.1  40.0  35.9  50.0  38.6

In [191]:
#由于DataFrame的基本索引是列索引，因此Series中多级索引的用法到了DataFrame中就应用到列上了
health_data['Guido', 'HR']

year  visit
2013  1        38.0
      2        49.0
2014  1        32.0
      2        40.0
Name: (Guido, HR), dtype: float64

In [192]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      29.0  36.5
     2      69.0  36.4

In [193]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        29.0
      2        69.0
2014  1        27.0
      2        14.0
Name: (Bob, HR), dtype: float64

In [194]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      29.0  38.0  46.0
2014 1      27.0  32.0  33.0

### 6.4多级索引行列转换  
**1.有序的索引和无序的索引**  
如果MultiIndex不是有序的索引，那么大多数切片操作都会失败

In [195]:
#首先创建一个不按字典顺序（lexicographically）排列的多级索引Series
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.091298
      2      0.349972
c     1      0.123339
      2      0.432675
b     1      0.253430
      2      0.552082
dtype: float64

In [196]:
data = data.sort_index()
data

char  int
a     1      0.091298
      2      0.349972
b     1      0.253430
      2      0.552082
c     1      0.123339
      2      0.432675
dtype: float64

In [197]:
data['a':'b']

char  int
a     1      0.091298
      2      0.349972
b     1      0.253430
      2      0.552082
dtype: float64

**2.索引stack与unstack**

In [198]:
#我们可以将一个多级索引数据集转换成简单的二维形式，可以通过level参数设置转换的索引层级
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [199]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [200]:
#unstack()是stack()的逆操作，同时使用这两种方法让数据保持不变
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

**3.索引的设置与重置**  
层级数据维度转换的另一种是行列标签转换，可以通过reset_index方法实现。如果在上面的人口数据Series中使用该方法，则会生成一个列标签中包含之前行索引标签state和year的DataFrame

In [201]:
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [202]:
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

### 6.5多级索引的数据累计方法

In [203]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      29.0  36.5  38.0  36.3  46.0  39.0
     2      69.0  36.4  49.0  37.0  51.0  37.4
2014 1      27.0  36.5  32.0  36.3  33.0  37.0
     2      14.0  37.1  40.0  35.9  50.0  38.6

In [204]:
#计算每一年各项指标的平均值，那么可以将参数level设置为索引year
data_mean = health_data.mean(level='year')
data_mean

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR  Temp
year
2013     49.0  36.45  43.5  36.65  48.5  38.2
2014     20.5  36.80  36.0  36.10  41.5  37.8

In [205]:
#如果再设置axis参数，就可以对列索引进行类似的累计操作
data_mean.mean(axis=1, level='type')

type         HR  Temp
year
2013  47.000000  37.1
2014  32.666667  36.9

## 7.合并数据集：Concat与Append操作

In [206]:
import pandas as pd
import numpy as np

In [208]:
def make_df(cols, ind):
    """一个简单的DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
           for c in cols}
    return pd.DataFrame(data, ind)

#DataFrame示例
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

### 7.1知识回顾：NumPy数组的合并

In [209]:
x = [1, 2, 3]
y = [4, 5, 6]
z = [7, 8, 9]
np.concatenate([x, y, z])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [210]:
x = [[1, 2],
    [3, 4]]
np.concatenate([x, x], axis=1)

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

### 7.2通过pd.concat实现简易合并

In [211]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [212]:
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])
print(df1);print(df2);print(pd.concat([df1, df2]))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [215]:
#默认情况下，DataFrame的合并都是逐行进行的
df3 = make_df('AB', [0, 1])
df4 = make_df('CD', [0, 1])
print(df3);print(df4);print(pd.concat([df3, df4], axis=1))

    A   B
0  A0  B0
1  A1  B1
    C   D
0  C0  D0
1  C1  D1
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

**1.索引重复**

In [216]:
#np.concatenate与pd.concat最主要的差异之一就是Pandas在合并时会保留索引
x = make_df('AB', [0, 1])
y = make_df('AB', [2, 3])
y.index = x.index
print(x);print(y);print(pd.concat([x, y]))

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

**(1)捕捉索引重复的错误。** 如果你想要检测pd.concat()合并的结果是否出现了重复的索引，可以设置verify_integrity参数。将参数设置为True，合并时若有索引就会触发异常。

In [217]:
try:
    pd.concat([x, y], verify_integrity=True)
except ValueError as e:
    print("ValueError:", e)

ValueError: Indexes have overlapping values: Int64Index([0, 1], dtype='int64')

**(2)忽略索引。** 有时索引无关紧要，那么合并时就可以忽略它们，可以通过设置ignore_index参数来实现。如果将参数设置为True，那么合并时将会创建一个新的整数索引

In [218]:
print(x);print(y);print(pd.concat([x, y], ignore_index=True))

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

**(3)增加多级索引。** 另一种处理索引重复的方法是通过keys参数为数据源设置多级索引标签

In [219]:
print(x);print(y);print(pd.concat([x, y], keys=['x', 'y']))

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

**2.类似join的合并**

In [220]:
df5 = make_df('ABC', [1, 2])
df6 = make_df('BCD', [3, 4])
print(df5);print(df6);print(pd.concat([df5, df6]))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [221]:
print(df5);print(df6);print(pd.concat([df5, df6], join='inner'))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

**3.append()方法**

In [224]:
print(df1);print(df2);print(df1.append(df2))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

## 8.合并数据集：合并与连接  
### 8.1关系代数  
pd.merge()实现的功能基于关系代数(relational algebra)的一部分。关系代数是处理关系型数据的通用理论，绝大部分数据库的可用操作的都是以此为理论基础。关系代数方法论的强大之处在于，它提出的若干简单操作规则经过组合就可以为任意数据集构建十分复杂的操作。  
### 8.2数据连接的类型 
pd.merge()函数实现了三种数据连接的类型：一对一、多对一和多对多。这三种数据连接类型都通过pd.merge()接口进行调用，根据不同的数据连接需求进行不同的操作  
**1.一对一连接**

In [225]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                   'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                   'hire_date': [2004, 2008, 2012, 2014]})
print(df1)
print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [227]:
df3 = pd.merge(df1, df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

**2.多对一连接**

In [228]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                   'supervisor': ['Carly', 'Guido', 'Steve']})
print(df3);print(df4);print(pd.merge(df3, df4))

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve
  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

**3.多对多连接**

In [229]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting', 'Engineering', 'Engineering',
                             'HR', 'HR'],
                   'skills': ['math', 'spreadsheets', 'coding', 'linux',
                             'spreadsheets', 'organization']})
print(df1);print(df5);print(pd.merge(df1, df5))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

### 8.3设置数据合并的键
**1.参数on的用法**

In [230]:
print(df1);print(df2);print(pd.merge(df1, df2, on='employee'))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

**2.left_on与right_on参数**

In [232]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                   'salary': [70000, 80000, 12000, 90000]})
print(df1);print(df3)
print(pd.merge(df1, df3, left_on='employee', right_on='name'))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa   12000
3   Sue   90000
  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa   12000
3      Sue           HR   Sue   90000

In [233]:
pd.merge(df1, df3, left_on='employee', right_on='name').drop('name', axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering   12000
3      Sue           HR   90000

**3.left_index与right_index参数**

In [234]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
print(df1a);print(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [235]:
print(df1a);print(df2a);print(pd.merge(df1a, df2a, left_index=True, right_index=True))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [236]:
print(df1a);print(df2a);print(df1a.join(df2a))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [238]:
print(df1a);print(df3);print(pd.merge(df1a, df3, left_index=True, right_on='name'))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa   12000
3   Sue   90000
         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa   12000
3           HR   Sue   90000

### 8.4设置数据连接的集合操作规则

In [240]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                   'food': ['fish', 'beans', 'bread']},
                  columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                   'drink': ['wine', 'beer']},
                  columns=['name', 'drink'])
print(df6);print(df7);print(pd.merge(df6, df7))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
   name   food drink
0  Mary  bread  wine

In [241]:
#内连接
pd.merge(df6, df7, how='inner')

   name   food drink
0  Mary  bread  wine

In [242]:
#外连接
print(df6);print(df7);print(pd.merge(df6, df7, how='outer'))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [243]:
#左连接和右连接
print(df6);print(df7);print(pd.merge(df6, df7, how='left'))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

### 8.5重复列名：suffixes参数

In [244]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                   'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                   'rank': [3, 1, 4, 2]})
print(df8);print(df9);print(pd.merge(df8, df9, on='name'))

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2
   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [245]:
print(df8);print(df9);print(pd.merge(df8, df9, on='name', suffixes=["_L", "_R"]))

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2
   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

## 9.累计与分组  
在对较大的数据进行分析时，一项基本的工作就是有效的数据累计（summarization）:计算累计（aggregation）指标，如sum()、mean()、median()、min()和max()，其中每一个指标都呈现了大数据集的特征。
### 9.1行星数据

In [13]:
#行星数据可以通过Seaborn下载
import seaborn as sns
import pandas as pd

planets = sns.load_dataset('planets')
planets.shape

(1035, 6)

In [2]:
import seaborn as sns
df = sns.load_dataset("penguins")
sns.pairplot(df, hue="species")

RemoteDisconnected: Remote end closed connection without response

In [14]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

### 9.2Pandas的简单累计功能

In [15]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.rand(5))
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [16]:
ser.sum()

2.811925491708157

In [17]:
ser.mean()

0.5623850983416314

In [18]:
#DataFrame的累计函数默认对每列进行统计
df = pd.DataFrame({'A': rng.rand(5),
                  'B': rng.rand(5)})
df

          A         B
0  0.155995  0.020584
1  0.058084  0.969910
2  0.866176  0.832443
3  0.601115  0.212339
4  0.708073  0.181825

In [19]:
df.mean()

A    0.477888
B    0.443420
dtype: float64

In [20]:
#设置axis参数
df.mean(axis='columns')

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

In [21]:
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

pandas的累计方法

|指标|描述|
|--|--|
|count()|计数项|
|first()、last()|第一项与最后一项|
|mean()、median()|均值与中位数|
|min()、max()|最小值与最大值|
|std()、var()|标准差与方差|
|mad()|均值绝对偏差（mean absolute deviation）|
|prod()|所有项乘积|
|sum()|所有项求和|

### 9.3GroupBy:分割、应用和组合  
**1.分割、应用和组合**  
·分割步骤将DataFrame按照指定的键分割成若干组  
·应用步骤对每个组应用函数，通常是累计、转换或过滤函数  
·组合步骤将每一组的结果合并成一个输出数组

In [22]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                  'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [23]:
df.groupby('key')

In [24]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

**2.GroupBy对象**  
GroupBy对象是一种非常灵活的抽象类型。GroupBy中最重要的操作问题可能就是aggregate、filter、transform和apply（累计、过滤、转换、应用）了  
**(1)按列取值。** GroupBy对象与DataFrame一样，也支持按列取值，并返回一个修改过的GroupBy对象

In [25]:
planets.groupby('method')

In [26]:
planets.groupby('method')['orbital_period']

In [27]:
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

**(2)按组迭代**

In [28]:
#GroupBy对象支持按组进行迭代，返回的每一组都是Series或DataFrame
for (method, group) in planets.groupby('method'):
    print("{0:30s} shape={1}".format(method, group.shape))

Astrometry                     shape=(2, 6)
Eclipse Timing Variations      shape=(9, 6)
Imaging                        shape=(38, 6)
Microlensing                   shape=(23, 6)
Orbital Brightness Modulation  shape=(3, 6)
Pulsar Timing                  shape=(5, 6)
Pulsation Timing Variations    shape=(1, 6)
Radial Velocity                shape=(553, 6)
Transit                        shape=(397, 6)
Transit Timing Variations      shape=(4, 6)

**(3)调用方法**

In [29]:
#用DataFrame的describe()方法进行累计，对每一组数据进行描述性统计
planets.groupby('method')['year'].describe().unstack()

       method
count  Astrometry                          2.0
       Eclipse Timing Variations           9.0
       Imaging                            38.0
       Microlensing                       23.0
       Orbital Brightness Modulation       3.0
                                         ...
max    Pulsar Timing                    2011.0
       Pulsation Timing Variations      2007.0
       Radial Velocity                  2014.0
       Transit                          2014.0
       Transit Timing Variations        2014.0
Length: 80, dtype: float64

In [30]:
rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                  'data1': range(6),
                  'data2': rng.randint(0, 10 ,6)},
                 columns=['key', 'data1', 'data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

**(1)累计**

In [31]:
#aggregate()可以支持更复杂的操作，比如字符串、函数或者函数列表，并且能一次性计算所有累计值
df.groupby('key').aggregate(['min', np.median, max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [32]:
#或者通过Python字典指定不同列需要累计的函数
df.groupby('key').aggregate({'data1': 'min',
                            'data2': 'max'})

     data1  data2
key
A        0      5
B        1      7
C        2      9

**(2)过滤**  
过滤操作可以让你按照分组的属性丢弃若干数据

In [33]:
#例如，我们可能只需要保留标准差超过某个阈值的组
def filter_func(x):
    return x['data2'].std() > 4

print(df);print(df.groupby('key').std());
print(df.groupby('key').filter(filter_func))

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9
       data1     data2
key
A    2.12132  1.414214
B    2.12132  4.949747
C    2.12132  4.242641
  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

**(3)转换**  
累计操作返回的是对组内全量数据缩减过的结果，而转换操作会返回一个新的全量数据。数据经过转换之后，其形状与原来的输入数据是一样的

In [34]:
#常见的例子就是将每一组的样本数据减去各组的均值，实现数据标准化
df.groupby('key').transform(lambda x: x - x.mean())

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

**(4)apply()方法**  
apply()方法让你可以在每个组上应用任意方法。这个函数输入一个DataFrame，返回一个Pandas对象或一个标量。组合操作会适应返回结果类型

In [35]:
#下面的例子就是用apply()方法将第一列数据以第二列的和为基数进行标准化
def norm_by_data2(x):
    # x是一个分组数据的DataFrame
    x['data1'] /= x['data2'].sum()
    return x

print(df);print(df.groupby('key').apply(norm_by_data2))

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9
  key     data1  data2
0   A  0.000000      5
1   B  0.142857      0
2   C  0.166667      3
3   A  0.375000      3
4   B  0.571429      7
5   C  0.416667      9

**4.设置分割的键**  
**(1)将列表、数组、Series或索引作为分组键**

In [36]:
#分组键可以是长度与DataFrame匹配的任意Series或列表
L = [0, 1, 0, 1, 2, 0]
print(df);print(df.groupby(L).sum())

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9
   data1  data2
0      7     17
1      4      3
2      4      7

In [37]:
print(df);print(df.groupby(df['key']).sum())

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9
     data1  data2
key
A        3      8
B        5      7
C        7     12

**(2)用字典或Series将索引映射到分组名称**

In [38]:
df2 = df.set_index('key')
mapping = {'A': 'vowel', 'B': 'consonant', 'C': 'consonant'}
print(df2);print(df2.groupby(mapping).sum())

     data1  data2
key
A        0      5
B        1      0
C        2      3
A        3      3
B        4      7
C        5      9
           data1  data2
consonant     12     19
vowel          3      8

**(3)任意Python函数**

In [40]:
print(df2);print(df2.groupby(str.lower).mean())

     data1  data2
key
A        0      5
B        1      0
C        2      3
A        3      3
B        4      7
C        5      9
   data1  data2
a    1.5    4.0
b    2.5    3.5
c    3.5    6.0

**(4)多个有效键构成的列表**

In [41]:
df2.groupby([str.lower, mapping]).mean()

             data1  data2
a vowel        1.5    4.0
b consonant    2.5    3.5
c consonant    3.5    6.0

**5.分组案例**

In [43]:
decade = 10 * (planets['year'] // 10)
decade = decade.astype(str) + 's'
decade.name = 'decade'
planets.groupby(['method', decade])['number'].sum().unstack().fillna(0)

decade                         1980s  1990s  2000s  2010s
method
Astrometry                       0.0    0.0    0.0    2.0
Eclipse Timing Variations        0.0    0.0    5.0   10.0
Imaging                          0.0    0.0   29.0   21.0
Microlensing                     0.0    0.0   12.0   15.0
Orbital Brightness Modulation    0.0    0.0    0.0    5.0
Pulsar Timing                    0.0    9.0    1.0    1.0
Pulsation Timing Variations      0.0    0.0    1.0    0.0
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          0.0    0.0   64.0  712.0
Transit Timing Variations        0.0    0.0    0.0    9.0

## 10.数据透视表  
数据透视表(pivot table)是一种类似的操作方法，常见于Excel与类似的表格应用中。数据透视表将每一列数据作为输入，输出将数据不断细分成多个维度累计信息的二维数据表。数据透视表更像一种多维的GroupBy累计操作。
### 10.1演示数据透视表

In [44]:
#我们使用Titanic的乘客信息来演示
import numpy as np
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [45]:
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

### 10.2手工制作数据透视表

In [46]:
titanic.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [47]:
#将船舱等级('class')与性别('sex')分组，然后选择生还状态('survived')列，应用均值('mean')累计函数，
#再将各组结果组合，最后通过行索引转列索操作将最里层的行索引转换成列索引，形成二维数组
titanic.groupby(['sex', 'class'])['survived'].aggregate('mean').unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

### 10.3数据透视表语法

In [48]:
titanic.pivot_table('survived', index='sex', columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

**1.多级数据透视表**

In [49]:
age = pd.cut(titanic['age'], [0, 18, 80])
titanic.pivot_table('survived', ['sex', age], 'class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663

In [50]:
fare = pd.qcut(titanic['fare'], 2)
titanic.pivot_table('survived', ['sex', age], [fare, 'class'])

fare            (-0.001, 14.454]            ... (14.454, 512.329]
class                      First    Second  ...            Second     Third
sex    age                                  ...
female (0, 18]               NaN  1.000000  ...          1.000000  0.318182
       (18, 80]              NaN  0.880000  ...          0.914286  0.391304
male   (0, 18]               NaN  0.000000  ...          0.818182  0.178571
       (18, 80]              0.0  0.098039  ...          0.030303  0.192308

[4 rows x 6 columns]

**2.其他数据透视表选项**

In [51]:
titanic.pivot_table(index='sex', columns='class',
                   aggfunc={'survived': sum, 'fare': 'mean'})

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

In [52]:
titanic.pivot_table('survived', index='sex', columns='class', margins=True)

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

## 11.向量化字符串操作  
### 11.1Pandas字符串操作简介

In [53]:
import numpy as np
x = np.array([2, 3, 5, 7, 11, 13])
x * 2

array([ 4,  6, 10, 14, 22, 26])

In [54]:
data = ['peter', 'Paul', 'MARY', 'gUIDO']
[s.capitalize() for s in data]

['Peter', 'Paul', 'Mary', 'Guido']

In [57]:
#我们用前面的数据data创建一个Pandas的Series
import pandas as pd
data[2] = None
names = pd.Series(data)
names

0    peter
1     Paul
2     None
3    gUIDO
dtype: object

In [58]:
#直接调用大写方法capitalize()将所有的字符串变成大写形式，缺失值会被跳过
names.str.capitalize()

0    Peter
1     Paul
2     None
3    Guido
dtype: object

### 11.2Pandas字符串方法列表

In [59]:
monte = pd.Series(['Graham Chapman', 'John Cleese', 'Terry Gilliam',
                  'Eric Idel', 'Terry Jones', 'Michael Palin'])

**1.与Python字符串方法相似的方法**  
    
    |len()|lower()|translate()|islower()|  
    |ljust()|upper()|startswith()|isupper()|  
    |rjust()|find()|endswith()|isnumeric()|  
    |center()|rfind()|isalnum()|isdecimal()|
    |zfill()|index()|isalpha()|split()|  
    |strip()|rindex()|isdigit()|rsplit()|
    |rstrip()|capitalize()|isspace()|partition()|
    |lstrip()|swapcase()|istitle()|rpartition()

In [60]:
monte.str.lower()

0    graham chapman
1       john cleese
2     terry gilliam
3         eric idel
4       terry jones
5     michael palin
dtype: object

In [61]:
monte.str.len()

0    14
1    11
2    13
3     9
4    11
5    13
dtype: int64

In [62]:
monte.str.startswith('T')

0    False
1    False
2     True
3    False
4     True
5    False
dtype: bool

In [63]:
monte.str.split()

0    [Graham, Chapman]
1       [John, Cleese]
2     [Terry, Gilliam]
3         [Eric, Idel]
4       [Terry, Jones]
5     [Michael, Palin]
dtype: object

**2.正则表达式的方法**


    Pandas向量化字符串方法与Python标准库的re模块函数的对应内容
    
|方法|描述|
|--|--|
|match()|对每个元素调用re.match(),返回布尔类型|
|extract()|对每个元素调用re.match(),返回匹配的字符串组（groups）|
|findall()|对每个元素调用re.findall()|
|replace()|用正则模式替换字符串|
|contains()|对每个元素调用re.search(),返回布尔类型值|
|count()|计算符合正则模式的字符串的数量|
|split()|等价于str.split(),支持正则表达式|
|rsplit()|等价于str.split(),支持正则表达式|

In [64]:
monte.str.extract('([A-Za-z]+)')

         0
0   Graham
1     John
2    Terry
3     Eric
4    Terry
5  Michael

In [65]:
monte.str.findall(r'^[^AEIOU].*[^aeiou]$')

0    [Graham Chapman]
1                  []
2     [Terry Gilliam]
3                  []
4       [Terry Jones]
5     [Michael Palin]
dtype: object

**3.其他字符串**

    其他Pandas字符串方法
    
|方法|描述|
|--|--|
|get()|获取元素索引位置上的值，索引从0开始|
|slice()|对元素进行切片取值|
|slice_replace()|对元素进行切换|
|cat()|连接字符串|
|repeat()|重复元素|
|normalize()|将字符串转换Unicode规范形式|
|pad()|在字符串的左边、右边或两边增加空格|
|wrap()|将字符串按照指定的宽度换行|
|join()|用分隔符连接Series的每个元素|
|get_dummies()|按照分隔符提取每个元素的dummy变量，转换为独热(one-hot)编码的DataFrame|

**(1)向量化字符串的取值与切片操作**

In [66]:
monte.str[0:3]

0    Gra
1    Joh
2    Ter
3    Eri
4    Ter
5    Mic
dtype: object

In [67]:
monte.str.split().str.get(-1)

0    Chapman
1     Cleese
2    Gilliam
3       Idel
4      Jones
5      Palin
dtype: object

**(2)指标变量**

In [68]:
full_monte = pd.DataFrame({'name': monte,
                          'info': ['B|C|D', 'B|D', 'A|C', 'B|D', 'B|C', 'B|C|D']})
full_monte

             name   info
0  Graham Chapman  B|C|D
1     John Cleese    B|D
2   Terry Gilliam    A|C
3       Eric Idel    B|D
4     Terry Jones    B|C
5   Michael Palin  B|C|D

In [69]:
full_monte['info'].str.get_dummies('|')

   A  B  C  D
0  0  1  1  1
1  0  1  0  1
2  1  0  1  0
3  0  1  0  1
4  0  1  1  0
5  0  1  1  1

## 12.处理时间序列  
·时间戳表示某个具体的时间点  
·时间间隔与周期表示开始时间点与结束时间点之间的时间长度。周期通常是指一种特殊形式的时间间隔，每个间隔长度相同，彼此之间不会重叠  
·时间增量(time delta)或持续时间(duration)表示精确的时间长度  
### 12.1Python的日期与时间工具  
**1.原生Python的日期与时间工具:datetime与dateutil**

In [70]:
#使用datetime类型创建一个日期
from datetime import datetime
datetime(year=2021, month=9, day=6)

datetime.datetime(2021, 9, 6, 0, 0)

In [71]:
from dateutil import parser
date = parser.parse("6th of Oct, 2021")
date

datetime.datetime(2021, 10, 6, 0, 0)

In [72]:
date.strftime('%A')

'Wednesday'

**2.时间类型数组：NumPy的datetime64类型**

In [73]:
import numpy as np
date = np.array('2021-10-06', dtype=np.datetime64)
date

array('2021-10-06', dtype='datetime64[D]')

In [74]:
date + np.arange(12)

array(['2021-10-06', '2021-10-07', '2021-10-08', '2021-10-09',
       '2021-10-10', '2021-10-11', '2021-10-12', '2021-10-13',
       '2021-10-14', '2021-10-15', '2021-10-16', '2021-10-17'],
      dtype='datetime64[D]')

In [76]:
np.datetime64('2021-10-06')

numpy.datetime64('2021-10-06')

In [77]:
np.datetime64('2021-10-06 20:00')

numpy.datetime64('2021-10-06T20:00')

**3.Pandas的日期与时间工具:理想与现实的最佳解决方案**   
Pandas所有关于日期与时间的处理方法全部都是通过Timestamp对象实现的，它利用numpy.datetime64的有效存储和向量化接口将datetime和dateutil的易用性有机结合起来。Pandas通过一组Timestamp对象就可以创建一个作为Series或DataFrame索引的DatetimeIndex

In [78]:
import pandas as pd
date = pd.to_datetime('7th of Oct, 2021')
date

Timestamp('2021-10-07 00:00:00')

In [79]:
date.strftime('%A')

'Thursday'

In [80]:
date + pd.to_timedelta(np.arange(12), 'D')

DatetimeIndex(['2021-10-07', '2021-10-08', '2021-10-09', '2021-10-10',
               '2021-10-11', '2021-10-12', '2021-10-13', '2021-10-14',
               '2021-10-15', '2021-10-16', '2021-10-17', '2021-10-18'],
              dtype='datetime64[ns]', freq=None)

### 12.2Pandas时间序列：用时间作索引

In [81]:
index = pd.DatetimeIndex(['2021-10-07', '2021-10-08', '2021-10-09', '2021-10-10'])
data = pd.Series([0, 1, 2, 3], index=index)
data

2021-10-07    0
2021-10-08    1
2021-10-09    2
2021-10-10    3
dtype: int64

In [82]:
data['2021-10-07': '2021-10-10']

2021-10-07    0
2021-10-08    1
2021-10-09    2
2021-10-10    3
dtype: int64

In [83]:
data['2021']

2021-10-07    0
2021-10-08    1
2021-10-09    2
2021-10-10    3
dtype: int64

### 12.3Pandas时间序列数据结构  
·针对时间戳数据，Pandas提供了Timestamp类型  
·针对时间周期数据，Pandas提供了Period类型  
·针对时间增量或持续时间，Pandas提供了Timedelta类型

In [84]:
dates = pd.to_datetime([datetime(2021, 10, 7), '8th of Oct, 2021', '2021-Oct-9', 
                        '10-10-2021', '20211011'])
dates

DatetimeIndex(['2021-10-07', '2021-10-08', '2021-10-09', '2021-10-10',
               '2021-10-11'],
              dtype='datetime64[ns]', freq=None)

In [86]:
dates.to_period('D')

PeriodIndex(['2021-10-07', '2021-10-08', '2021-10-09', '2021-10-10',
             '2021-10-11'],
            dtype='period[D]', freq='D')

In [87]:
dates - dates[0]

TimedeltaIndex(['0 days', '1 days', '2 days', '3 days', '4 days'], dtype='timedelta64[ns]', freq=None)

In [89]:
pd.date_range('2021-10-07', '2021-10-11')

DatetimeIndex(['2021-10-07', '2021-10-08', '2021-10-09', '2021-10-10',
               '2021-10-11'],
              dtype='datetime64[ns]', freq='D')

### 12.4时间频率与偏移量  


    Pandas频率代码
|代码|描述|代码|描述|
|--|--|--|--|
|D|天(calendar day,按日历算，含双休日)|B|天(business day,仅含工作日)|
|W|周(weekly)|||
|M|月末(month day)|BM|月末(business month end,仅含工作日)|
|Q|季末(quarterr end)|BQ|季末(business quarter end,仅含工作日)|
|A|年末(year end)|BQ|季末(year quarter end,仅含工作日)|
|H|小时(hour)|BH|小时(business,工作时间)|
|T|分钟(minutes)|||
|S|秒(seconds)|||
|L|毫秒(milliseconds)|||
|U|微秒(microseconds)|||
|N|纳秒(nanoseconds)|||





    带开始索引的频率代码
|代码|频率|
|--|--|
|MS|月初(month start)|
|BMS|月初(business month start,仅含工作日)|
|QS|季初(quarter start)|
|BQS|季初(business quarter start,仅含工作日)|
|AS|年初(year start)|
|BAS|年初(business year start,仅含工作日)|

In [90]:
pd.timedelta_range(0, periods=9, freq='2H30T')

TimedeltaIndex(['0 days 00:00:00', '0 days 02:30:00', '0 days 05:00:00',
                '0 days 07:30:00', '0 days 10:00:00', '0 days 12:30:00',
                '0 days 15:00:00', '0 days 17:30:00', '0 days 20:00:00'],
               dtype='timedelta64[ns]', freq='150T')

In [92]:
from pandas.tseries.offsets import BDay
pd.date_range('2021-10-01', periods=5, freq=BDay())

DatetimeIndex(['2021-10-01', '2021-10-04', '2021-10-05', '2021-10-06',
               '2021-10-07'],
              dtype='datetime64[ns]', freq='B')